app/controllers/pending_carts_controller.rb

SELECT "pending_carts".* FROM "pending_carts"
---
  def index
    @cart = PendingCart.all

SELECT "pending_carts".* FROM "pending_carts" WHERE "pending_carts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "pending_carts" WHERE "pending_carts"."id" = ?  [["id", 11]]
---
  def destroy
    item = PendingCart.find(params[:id])
    item.destroy

INSERT INTO "pending_carts" ("user_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["product_id", 2], ["created_at", "2020-07-28 21:25:49.020815"], ["updated_at", "2020-07-28 21:25:49.020815"]]
---
  def create
    cart = PendingCart.new(cart_params)
    if cart.save