app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
    def index
      @shoes = Product.shoe.select {|t| t.notsold}

SELECT "products".* FROM "products"
---
    def shoepage
      @products = Product.shoe.select {|t| t.notsold}

SELECT "products".* FROM "products"
---
    def accessorypage
      @products = Product.accessory.select {|t| t.notsold}

SELECT "products".* FROM "products"
---
    def streetwearpage
      @products = Product.streetwear.select {|t| t.notsold}

SELECT "categories".* FROM "categories"
SELECT "conditions".* FROM "conditions"
---
    def new
      @product = Product.new
      @categories = Category.all.sort_by{|t| t.title}
      @conditions = Condition.all.sort_by{|t| t.id}.reverse

INSERT INTO "products" ("seller_id", "name", "product_type", "price", "condition", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      product = Product.new(product_params)
      product.seller_id = current_user.id
      if product.save