app/controllers/products_controller.rb

INSERT INTO "products" ("seller_id", "name", "product_type", "price", "condition", "color", "publish_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      product = Product.new(product_params)
      product.seller_id = current_user.id
      if product.save

UPDATE "products" SET "updated_at" = ? WHERE "products"."id" = ?  [["updated_at", "2020-07-28 18:57:28.213219"], ["id", 3]]
---
    def update
      product = Product.find(params[:id])
      if product.update(product_params)