app/controllers/purchased_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def new
      # @purchased_item = PurchasedItem.new
      @current_user = current_user
      @product = Product.find(params[:id])

INSERT INTO "purchased_items" ("buyer_id", "created_at", "updated_at", "product_id") VALUES (?, ?, ?, ?)  [["buyer_id", 9], ["created_at", "2020-07-29 18:05:46.457851"], ["updated_at", "2020-07-29 18:05:46.457851"], ["product_id", 4]]
UPDATE "products" SET "purchased_item_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["purchased_item_id", 10], ["updated_at", "2020-07-29 18:06:23.970999"], ["id", 4]]
---
    def create
      # byebug
      # buyer_id = current_user.id
      # product_id = params[:id]

      # purchased_item = PurchasedItem.create(buyer_id:buyer_id, product_id:product_id)
      purchased_item = PurchasedItem.create(purchase_params)
      product = purchased_item.product
      product.purchased_item_id = purchased_item.id
      product.save

SELECT "purchased_items".* FROM "purchased_items"
---
    def index
      @purchased_items = PurchasedItem.all