app/controllers/purchased_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def create
      buyer_id = current_user.id
      purchased_item = PurchasedItem.create(buyer_id: buyer_id)
      product = Product.find(params[:id])