app/controllers/reviews_controller.rb

  def new
    @purchased_item = PurchasedItem.find(params[:id])
---
SELECT "purchased_items".* FROM "purchased_items" WHERE "purchased_items"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]