app/models/product.rb

SELECT "products".* FROM "products"
---
    def self.shoe
        Product.all.select {|t| t.product_type == "Shoe"}